app/views/traders/dashboard.html.erb

SELECT 1 AS one FROM "properties" WHERE "properties"."portfolio_id" = $1 LIMIT $2  [["portfolio_id", 4], ["LIMIT", 1]]
---
<% if @portfolio && current_user.status == "approved" %>
  <% if !@portfolio.properties.empty? %>