app/views/transactions/admin_show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."last_name" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <h2>Transaction No: <%= @transaction.id %></h2>
    <p>Trader: <%= @transaction.user.first_name %> <%= @transaction.user.last_name %></p>